/*
 * 컬렉션 프레임워크 (Collection Framework)
 * : 자료구조 + 알고리즘
 * -------------------------------------------------------------------------------------------------------------
 * 									순서		|	중복허용	 |	구현 클래스
 * -------------------------------------------------------------------------------------------------------------			
 * : Collection<E> <- List<E>	(저장순서)O		  O			ArrayList, LinkedList, Stack, Queue
 * 				   <- Set<E>	 X				  X			HashSet, TreeSet
 * 	 Map<K, V>					 X			  key   : X		HashMap, TreeMap
 * 										  	  value : O
 * -------------------------------------------------------------------------------------------------------------
 */
public class CollectionFramework {

}
